{
    "node_type_to_id": {
        "<UNK_TYPE>": 0,
        "program": 1,
        "import_declaration": 2,
        "import": 3,
        "scoped_identifier": 4,
        "identifier": 5,
        ".": 6,
        "asterisk": 7,
        "*": 8,
        ";": 9,
        "class_declaration": 10,
        "modifiers": 11,
        "public": 12,
        "class": 13,
        "class_body": 14,
        "{": 15,
        "method_declaration": 16,
        "static": 17,
        "void_type": 18,
        "formal_parameters": 19,
        "(": 20,
        "formal_parameter": 21,
        "array_type": 22,
        "type_identifier": 23,
        "dimensions": 24,
        "[": 25,
        "]": 26,
        ")": 27,
        "block": 28,
        "local_variable_declaration": 29,
        "variable_declarator": 30,
        "=": 31,
        "object_creation_expression": 32,
        "new": 33,
        "argument_list": 34,
        "field_access": 35,
        "integral_type": 36,
        "int": 37,
        "method_invocation": 38,
        "generic_type": 39,
        "type_arguments": 40,
        "<": 41,
        ",": 42,
        ">": 43,
        "for_statement": 44,
        "for": 45,
        "decimal_integer_literal": 46,
        "binary_expression": 47,
        "update_expression": 48,
        "++": 49,
        "expression_statement": 50,
        "+": 51,
        "}": 52,
        "enhanced_for_statement": 53,
        "scoped_type_identifier": 54,
        ":": 55,
        "--": 56,
        "if_statement": 57,
        "if": 58,
        "parenthesized_expression": 59,
        "==": 60,
        "else": 61,
        "string_literal": 62,
        "\"": 63,
        "string_fragment": 64,
        "return_statement": 65,
        "return": 66,
        "private": 67,
        "boolean_type": 68,
        "&&": 69,
        "true": 70,
        "unary_expression": 71,
        "!": 72,
        "false": 73,
        "<=": 74,
        "throw_statement": 75,
        "throw": 76,
        "^": 77,
        "char": 78,
        "character_literal": 79,
        "field_declaration": 80,
        "/": 81,
        "array_creation_expression": 82,
        "dimensions_expr": 83,
        "assignment_expression": 84,
        "array_access": 85,
        "%": 86,
        "!=": 87,
        "throws": 88,
        "ternary_expression": 89,
        "?": 90,
        "long": 91,
        "-": 92,
        "byte": 93,
        ">=": 94,
        "try_statement": 95,
        "try": 96,
        "catch_clause": 97,
        "catch": 98,
        "catch_formal_parameter": 99,
        "catch_type": 100,
        "while_statement": 101,
        "while": 102,
        "floating_point_type": 103,
        "double": 104,
        "cast_expression": 105,
        "||": 106,
        "spread_parameter": 107,
        "...": 108,
        "constructor_declaration": 109,
        "constructor_body": 110,
        "this": 111,
        "/=": 112,
        "+=": 113,
        "final": 114,
        "*=": 115,
        "try_with_resources_statement": 116,
        "resource_specification": 117,
        "resource": 118,
        "lambda_expression": 119,
        "->": 120,
        "package_declaration": 121,
        "package": 122,
        "-=": 123,
        "escape_sequence": 124,
        "switch_expression": 125,
        "switch": 126,
        "switch_block": 127,
        "switch_block_statement_group": 128,
        "switch_label": 129,
        "case": 130,
        "break_statement": 131,
        "break": 132,
        "super_interfaces": 133,
        "implements": 134,
        "type_list": 135,
        "inferred_parameters": 136,
        "null_literal": 137,
        "continue_statement": 138,
        "continue": 139,
        "<<": 140,
        "decimal_floating_point_literal": 141,
        "%=": 142,
        "&": 143,
        "~": 144,
        "array_initializer": 145,
        "explicit_constructor_invocation": 146,
        "marker_annotation": 147,
        "@": 148,
        "|": 149,
        "do_statement": 150,
        "do": 151,
        ">>": 152,
        "type_parameters": 153,
        "type_parameter": 154,
        "instanceof_expression": 155,
        "instanceof": 156,
        "annotation": 157,
        "annotation_argument_list": 158,
        "|=": 159,
        "&=": 160,
        "hex_integer_literal": 161,
        ">>>": 162,
        ">>>=": 163,
        "static_initializer": 164,
        "method_reference": 165,
        "::": 166,
        "superclass": 167,
        "extends": 168,
        "super": 169,
        "hex_floating_point_literal": 170,
        "^=": 171,
        "assert_statement": 172,
        "assert": 173,
        "<<=": 174,
        ">>=": 175,
        "interface_declaration": 176,
        "interface": 177,
        "interface_body": 178,
        "default": 179,
        "ERROR": 180,
        "protected": 181,
        "extends_interfaces": 182,
        "constant_declaration": 183,
        "abstract": 184,
        "finally_clause": 185,
        "finally": 186,
        "float": 187,
        "labeled_statement": 188,
        "enum_declaration": 189,
        "enum": 190,
        "enum_body": 191,
        "enum_constant": 192,
        "enum_body_declarations": 193,
        "wildcard": 194,
        "type_bound": 195,
        "element_value_array_initializer": 196,
        "underscore_pattern": 197,
        "short": 198,
        "transient": 199,
        "class_literal": 200,
        "volatile": 201,
        "binary_integer_literal": 202,
        "synchronized": 203,
        "strictfp": 204,
        "octal_integer_literal": 205,
        "synchronized_statement": 206,
        "compact_constructor_declaration": 207
    },
    "next_node_type_id": 208,
    "node_vocab_size": 2000
}